balance/src/AccumulationRegisters/Движения/Движения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Движения</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.СтатьиДвижения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеКудаОткуда</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияКудаОткуда</name>
    <type>
      <types>CatalogRef.СтатьиДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

balance/src/HTTPServices/MonthlyBalances/Module.bsl
Функция ПолучитьОстаткиПоМесяцамgetBalances(Запрос)
	
	НачалоПериода = Запрос.ПараметрыЗапроса.Получить("begin");
	Если НачалоПериода = Неопределено Тогда
		СтрокаОшибки = "не указано начало периода отбора";
		Отказ = истина;
	КонецЕсли;
	
	КонецПериода = Запрос.ПараметрыЗапроса.Получить("end");
	Если КонецПериода = Неопределено Тогда
		СтрокаОшибки = "не указан конец периода отбора";
	КонецЕсли;
	
	ЗапросОстатков = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	СпрПодразделение.Ссылка КАК Подразделение
	                              |ПОМЕСТИТЬ ТЗПодразделений
	                              |ИЗ
	                              |	Справочник.Подразделения КАК СпрПодразделение
	                              |ГДЕ
	                              |	НЕ СпрПодразделение.ПометкаУдаления
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), МЕСЯЦ, t.n) КАК Дата,
	                              |	ТЗПодразделений.Подразделение КАК Подразделение
	                              |ПОМЕСТИТЬ ТаблицаДата
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		6 * (t1.a - 1) + t2.b - 1 КАК n
	                              |	ИЗ
	                              |		(ВЫБРАТЬ
	                              |			1 КАК a
	                              |		
	                              |		ОБЪЕДИНИТЬ
	                              |		
	                              |		ВЫБРАТЬ
	                              |			2
	                              |		
	                              |		ОБЪЕДИНИТЬ
	                              |		
	                              |		ВЫБРАТЬ
	                              |			3
	                              |		
	                              |		ОБЪЕДИНИТЬ
	                              |		
	                              |		ВЫБРАТЬ
	                              |			4
	                              |		
	                              |		ОБЪЕДИНИТЬ
	                              |		
	                              |		ВЫБРАТЬ
	                              |			5
	                              |		
	                              |		ОБЪЕДИНИТЬ
	                              |		
	                              |		ВЫБРАТЬ
	                              |			6) КАК t1
	                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |				1 КАК b
	                              |			
	                              |			ОБЪЕДИНИТЬ
	                              |			
	                              |			ВЫБРАТЬ
	                              |				2
	                              |			
	                              |			ОБЪЕДИНИТЬ
	                              |			
	                              |			ВЫБРАТЬ
	                              |				3
	                              |			
	                              |			ОБЪЕДИНИТЬ
	                              |			
	                              |			ВЫБРАТЬ
	                              |				4
	                              |			
	                              |			ОБЪЕДИНИТЬ
	                              |			
	                              |			ВЫБРАТЬ
	                              |				5
	                              |			
	                              |			ОБЪЕДИНИТЬ
	                              |			
	                              |			ВЫБРАТЬ
	                              |				6) КАК t2
	                              |			ПО (ИСТИНА)) КАК t,
	                              |	ТЗПодразделений КАК ТЗПодразделений
	                              |ГДЕ
	                              |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), МЕСЯЦ, t.n) <= &КонецПериода
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	                              |	ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
	                              |	МАКСИМУМ(ВложенныйЗапрос.Сумма) КАК Сумма
	                              |ПОМЕСТИТЬ Остатки
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		&НачалоПериода КАК НачалоПериода,
	                              |		ДвиженияОстатки.Подразделение КАК Подразделение,
	                              |		ДвиженияОстатки.СуммаОстаток КАК Сумма
	                              |	ИЗ
	                              |		РегистрНакопления.Движения.Остатки(&НачалоПериода, ) КАК ДвиженияОстатки
	                              |	
	                              |	ОБЪЕДИНИТЬ ВСЕ
	                              |	
	                              |	ВЫБРАТЬ
	                              |		НАЧАЛОПЕРИОДА(ДвиженияОстаткиИОбороты.Период, ДЕНЬ),
	                              |		ДвиженияОстаткиИОбороты.Подразделение,
	                              |		ДвиженияОстаткиИОбороты.СуммаНачальныйОстаток
	                              |	ИЗ
	                              |		РегистрНакопления.Движения.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ДвиженияОстаткиИОбороты) КАК ВложенныйЗапрос
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ВложенныйЗапрос.НачалоПериода,
	                              |	ВложенныйЗапрос.Подразделение
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	Остатки.НачалоПериода КАК НачалоПериода,
	                              |	МИНИМУМ(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ОстаткиКонец.НачалоПериода, ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1)), СЕКУНДА, -1)) КАК КонецПериода,
	                              |	Остатки.Подразделение КАК Подразделение,
	                              |	Остатки.Сумма КАК Сумма
	                              |ПОМЕСТИТЬ ОстаткиПериодами
	                              |ИЗ
	                              |	Остатки КАК Остатки
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК ОстаткиКонец
	                              |		ПО Остатки.Подразделение = ОстаткиКонец.Подразделение
	                              |			И Остатки.НачалоПериода < ОстаткиКонец.НачалоПериода
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	Остатки.НачалоПериода,
	                              |	Остатки.Подразделение,
	                              |	Остатки.Сумма
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////
	                              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	ЕСТЬNULL(ТаблицаДата.Дата, """") КАК Дата,
	                              |	ЕСТЬNULL(ТаблицаДата.Подразделение, """") КАК Подразделение,
	                              |	ЕСТЬNULL(ОстаткиПериодами.Сумма, 0) КАК Сумма
	                              |ИЗ
	                              |	ТаблицаДата КАК ТаблицаДата
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПериодами КАК ОстаткиПериодами
	                              |		ПО (ТаблицаДата.Дата МЕЖДУ ОстаткиПериодами.НачалоПериода И ОстаткиПериодами.КонецПериода)
	                              |			И ТаблицаДата.Подразделение = ОстаткиПериодами.Подразделение
	                              |
	                              |УПОРЯДОЧИТЬ ПО
	                              |	Дата
	                              |ИТОГИ ПО
	                              |	Дата");	      
	ЗапросОстатков.УстановитьПараметр("НачалоПериода",Дата(Запрос.ПараметрыЗапроса.Получить("begin")));
	ЗапросОстатков.УстановитьПараметр("КонецПериода",Дата(Запрос.ПараметрыЗапроса.Получить("end")));
	Дерево = ЗапросОстатков.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Если  Дерево.Строки.Количество() > 0 Тогда
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
			//МассивГруппировок 		= Новый Массив;
			//СтруктураГруппировки 	= Новый Структура;
		ЗаписьJSON.ЗаписатьНачалоМассива();	
			Для Каждого Строка из Дерево.Строки Цикл
				
				//МассивДетальныхЗаписей 		= Новый Массив;
				//СтруктураДетальныхЗаписей 	= Новый Структура;
				 ЗаписьJSON.ЗаписатьНачалоМассива();
				 ЗаписьJSON.ЗаписатьЗначение(Строка(Строка.Дата));
				 //
				 Для Каждого Запись из Строка.Строки Цикл
					    ЗаписьJSON.ЗаписатьНачалоОбъекта();
						 ЗаписьJSON.ЗаписатьИмяСвойства("Дата");
						 ЗаписьJSON.ЗаписатьЗначение(Строка(Запись.Дата));
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						 ЗаписьJSON.ЗаписатьИмяСвойства("Подразделение");
						 ЗаписьJSON.ЗаписатьЗначение(Строка(Запись.Подразделение.УникальныйИдентификатор()));
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						 ЗаписьJSON.ЗаписатьИмяСвойства("Сумма");
						 ЗаписьJSON.ЗаписатьЗначение(Запись.Сумма);
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						//СтруктураДетальныхЗаписей.Вставить("Дата",			Запись.Дата);
						//СтруктураДетальныхЗаписей.Вставить("Подразделение",	Запись.Подразделение);
						//СтруктураДетальныхЗаписей.Вставить("Сумма",			Запись.Сумма);
						//МассивДетальныхЗаписей.Добавить(СтруктураДетальныхЗаписей);
					КонецЦикла;
				
				ЗаписьJSON.ЗаписатьКонецМассива();	
					
			   //СтруктураГруппировки.Вставить("Период",Строка.Дата);
			   //СтруктураГруппировки.Вставить("ДетальныеЗаписи",МассивДетальныхЗаписей);
			   //МассивГруппировок.Добавить(СтруктураГруппировки);
			КонецЦикла;	
	ЗаписьJSON.ЗаписатьКонецМассива();	
	//СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, МассивГруппировок);
	//ЗаписатьJSON(ЗаписьJSON, ,НастройкиСериализацииJSON);
	 
	 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		
	Ответ = Новый HTTPСервисОтвет(200);	
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Иначе
	СтрокаОшибки = "нет результатов";
	Отказ = Истина;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции
